In [7]:
class Person:
    def __init__(self,name,age,profession):
        self.name = name
        self.age = age
        self.profession = profession
        
    def show(self):
        ("Name:",self.name,"Age",self.age)
        
    def work(self):
        (self.name, "working as a", self.profession)
    
Arunima= Person('Arunima','31','Python Developer')

Arunima.show()
Arunima.work()

In [8]:
class Person:
    def __init__(self,name,age,profession):
        self.name = name
        self.age = age
        self.profession = profession
        
    def show(self):
        ("Name:",self.name,"Age",self.age)
        
    def work(self):
        (self.name, "working as a", self.profession)
    
Arunima= Person('Arunima','31','Python Developer')

Arunima.show()
Arunima.work()

In [18]:
class Person:
    def __init__(self,name,age,profession):
        self.name = name
        self.age = age
        self.profession = profession
        
    def show(self):
        print("Name:",self.name,"Age",self.age)
        
    def work(self):
        print(self.name, "working as a", self.profession)
    
Arunima= Person('Arunima','31','Python Developer')

Arunima.show()
Arunima.work()

Name: Arunima Age 31
Arunima working as a Python Developer

In [38]:
class student:
    school_name = 'BD school'
    
    def __init__(self,name,age):
        self.name = name
        self.age = age
        
s1 = student("Anuradha",13)
print("student:",s1.name, s1.age)

print("school name",student.school_name)

s1.name = 'Rimka'
s1.age = 12

print("student", s1.name, s1.age)

student.school_name = 'xyz school'
print("school name", student.school_name)

student: Anuradha 13
school name BD school
student Rimka 12
school name xyz school

In [28]:
class Student:
    # class variable
    school_name = 'ABC School'

    # constructor
    def __init__(self, name, age):
        # instance variables
        self.name = name
        self.age = age

    # instance method
    def show(self):
        # access instance variables and class variables
        print('Student:', self.name, self.age, Student.school_name)

    # instance method
    def change_age(self, new_age):
        # modify instance variable
        self.age = new_age

    # class method
    @classmethod
    def modify_school_name(cls, new_name):
        # modify class variable
        cls.school_name = new_name

s1 = Student("Harry", 12)

# call instance methods
s1.show()
s1.change_age(14)

# call class method
Student.modify_school_name('XYZ School')
# call instance methods
s1.show()

Student: Harry 12 ABC School
Student: Harry 14 XYZ School

In [36]:
class Vehicle:
    def __init__(self,max_speed, mileage):
        self.max_speed = max_speed
        self.mileage = mileage
    
    
    def show(self):
        print("Max speed is",self.max_speed)
        print("Mileage is", self.mileage)
        
Audi= Vehicle("500km",250)
Audi.show()

Max speed is 500km
Mileage is 250

In [37]:
class Vehicle:
    pass

In [53]:
class Student_Info:
    def __init__(self, name, marks):
        self.name = name
        self.marks = marks

Student = Student_Info("Anuradha",13)
print("student and marks :",Student.name, Student.marks)

s1.name = 'Arunima'
s1.marks = 13

print("Modified student name and marks is:",s1.name, s1.marks)

student and marks : Anuradha 13
Modified student name and marks is: Arunima 13

In [ ]:
class Student:
    student_id = 'V10'
    student_name = 'Jacqueline Barnett'
    def display():
        print(f'Student id: {Student.student_id}\nStudent Name: {Student.student_name}')
print("Original attributes and their values of the Student class:")
Student.display()

In [70]:
class student:
    def __init__(self,studentid, name):
        self.studentid = studentid
        self.name = name
       
s1 = student(13,"Anuradha")
print("student:",s1.studentid, s1.name)
for attr, value in Student.__dict__.items():
    if not attr.startswith('_'):
        print(f'{attr} -> {value}')
print("\nAfter adding the student_class, attributes and their values with the said class:")
Student.student_class  = 'V'
for attr, value in Student.__dict__.items():
    if not attr.startswith('_'):
        print(f'{attr} -> {value}')

student: 13 Anuradha
student_class -> V

After adding the student_class, attributes and their values with the said class:
student_class -> V

After removing the student_name, attributes and their values from the said class:

AttributeError: student_name

In [ ]:
import pandas as pd

In [71]:
data = [['Alex',10],['Bob',12],['Clarke',13]]

In [74]:
df = pd.DataFrame(data,columns=['Name','Age'],dtype=float)

NameError: name 'pd' is not defined

In [75]:
import pandas as pd

In [76]:
data = [['Alex',10],['Bob',12],['Clarke',13]]

In [77]:
df = pd.DataFrame(data,columns=['Name','Age'],dtype=float)

C:\Users\Arunima\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3444: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised
  exec(code_obj, self.user_global_ns, self.user_ns)

In [78]:
df

     Name   Age
0    Alex  10.0
1     Bob  12.0
2  Clarke  13.0

In [79]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}

In [80]:
df = pd.DataFrame(data)

In [81]:
df

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [82]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}

In [83]:
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])

In [84]:
df

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [87]:
import pandas as pd

In [89]:
data = {'Name':['Tom','Jack','Steve','Ricky'],'Age':[90,56,43,45]}

In [90]:
df = pd.DataFrame(data, index = ['rank1', 'rank2', 'rank3','rank4'])

In [91]:
df

        Name  Age
rank1    Tom   90
rank2   Jack   56
rank3  Steve   43
rank4  Ricky   45

In [92]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]

In [93]:
df = pd.DataFrame(data)

In [94]:
print(df)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [95]:
data = [{'a':1,'b':2},{'a':5,'b':6,'c':20}]

In [97]:
df = pd.DataFrame(data, column= ['a','b','c'])

TypeError: __init__() got an unexpected keyword argument 'column'

In [98]:
df

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [99]:
data = [{'a':1,'b':2},{'a':5,'b':6,'c':6}]

In [100]:
df = pd.DataFrame(data, index= [1,2])

In [101]:
print(df)

   a  b    c
1  1  2  NaN
2  5  6  6.0

In [103]:
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print (df)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [107]:
import pandas as pd
d = {'one':pd.Series([1,2,3], index = ['a','b','c']),
     'two' : pd.Series([1,2,3,4], index = ['a','b','c','d'])}

df= pd.DataFrame(d)
print (df)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [111]:
import pandas as pd 

d = {'one':pd.Series([1,2,3], index = ['a','b','c']),
     'two' : pd.Series([1,2,3,4], index = ['a','b','c','d'])}

df = pd.DataFrame(d)
print (df['one'])

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [114]:
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)

df['three'] = pd.Series([10,20,30], index = ['a','b','c'])
print(df)

df['four'] = df['three'] + df['one']
print(df)

   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN
   one  two  three  four
a  1.0    1   10.0  11.0
b  2.0    2   20.0  22.0
c  3.0    3   30.0  33.0
d  NaN    4    NaN   NaN

In [115]:
df.pop('two') 
print(df)

   one  three  four
a  1.0   10.0  11.0
b  2.0   20.0  22.0
c  3.0   30.0  33.0
d  NaN    NaN   NaN

In [117]:
del df['one']

In [118]:
df

   three  four
a   10.0  11.0
b   20.0  22.0
c   30.0  33.0
d    NaN   NaN

In [121]:
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print (df.loc['b'])

one    2.0
two    2.0
Name: b, dtype: float64

In [123]:
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print (df.iloc[2])

one    3.0
two    3.0
Name: c, dtype: float64

In [125]:
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print (df[2:4])

   one  two
c  3.0    3
d  NaN    4

In [134]:
import pandas as pd
df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

df = df.append(df2)
print(df)
df = df.drop(0)
df

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

   a  b
1  3  4
1  7  8

In [136]:
import pandas as pd
import numpy as np

s = pd.Series(np.random.randn(4))
print (s)

0    1.236843
1    1.267970
2    0.041212
3   -0.255410
dtype: float64

In [138]:
import pandas as pd
import numpy as np

s = pd.Series(np.random.randn(4))
print ("The axes are:")
print (s.axes)

The axes are:
[RangeIndex(start=0, stop=4, step=1)]

In [139]:
import pandas as pd
import numpy as np

#Create a series with 100 random numbers
s = pd.Series(np.random.randn(4))
print ("Is the Object empty?")
print (s.empty)

Is the Object empty?
False

In [141]:
import pandas as pd
import numpy as np

#Create a series with 4 random numbers
s = pd.Series(np.random.randn(4))
print (s)

print ("The dimensions of the object:")
print (s.ndim)

0    0.908755
1    0.647418
2   -0.551001
3   -1.733496
dtype: float64
The dimensions of the object:
1

In [142]:
import pandas as pd
import numpy as np

#Create a series with 4 random numbers
s = pd.Series(np.random.randn(2))
print (s)
print ("The size of the object:")
print (s.size)

0    1.695592
1   -0.446886
dtype: float64
The size of the object:
2

In [143]:
import pandas as pd
import numpy as np

#Create a series with 4 random numbers
s = pd.Series(np.random.randn(4))
print (s)

print ("The actual data series is:")
print (s.values)

0   -0.489163
1   -0.446809
2   -1.939180
3    0.358515
dtype: float64
The actual data series is:
[-0.48916294 -0.44680917 -1.93918012  0.35851541]

In [145]:
import pandas as pd
import numpy as np

#Create a series with 4 random numbers
s = pd.Series(np.random.randn(4))
print ("The original series is:")
print (s)

print ("The last two rows of the data series:")
print (s.tail(2))

The original series is:
0   -1.188445
1    0.709026
2   -0.616301
3    0.418511
dtype: float64
The last two rows of the data series:
2   -0.616301
3    0.418511
dtype: float64

In [147]:
import pandas as pd
import numpy as np

#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}

#Create a DataFrame
df = pd.DataFrame(d)
print ("Our data series is:")
print (df)

Our data series is:
    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80

In [149]:
import pandas as pd
import numpy as np
 
# Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}

# Create a DataFrame
df = pd.DataFrame(d)
print ("The transpose of the data series is:")
print (df.T)

The transpose of the data series is:
           0      1      2     3      4      5     6
Name     Tom  James  Ricky   Vin  Steve  Smith  Jack
Age       25     26     25    23     30     29    23
Rating  4.23   3.24   3.98  2.56    3.2    4.6   3.8

In [150]:
import pandas as pd
import numpy as np
 
# Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}

df = pd.DataFrame(d)
print("the transpose of series is")
print(df.T)

the transpose of series is
           0      1      2     3      4      5     6
Name     Tom  James  Ricky   Vin  Steve  Smith  Jack
Age       25     26     25    23     30     29    23
Rating  4.23   3.24   3.98  2.56    3.2    4.6   3.8

In [152]:
import pandas as pd
import numpy as np

#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}

#Create a DataFrame
df = pd.DataFrame(d)
print ("Row axis labels and column axis labels are:")
print (df.axes)

Row axis labels and column axis labels are:
[RangeIndex(start=0, stop=7, step=1), Index(['Name', 'Age', 'Rating'], dtype='object')]

In [153]:
import pandas as pd
import numpy as np

#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}

#Create a DataFrame
df = pd.DataFrame(d)
print ("The data types of each column are:")
print (df.dtypes)

The data types of each column are:
Name       object
Age         int64
Rating    float64
dtype: object

In [154]:
import pandas as pd
import numpy as np

d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

df = pd.DataFrame(d)
print(df)

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [157]:
import pandas as pd
import numpy as np
 
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

df = pd.DataFrame(d)
print (df.sum())

Name      TomJamesRickyVinSteveSmithJackLeeDavidGasperBe...
Age                                                     382
Rating                                                44.92
dtype: object

In [158]:
import pandas as pd
import numpy as np

#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

#Create a DataFrame
df = pd.DataFrame(d)
print(df.mean())

Age       31.833333
Rating     3.743333
dtype: float64

C:\Users\Arunima\AppData\Local\Temp/ipykernel_12596/3756148833.py:13: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(df.mean())

In [159]:
import pandas as pd
import numpy as np

#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

#Create a DataFrame
df = pd.DataFrame(d)
print (df.std())

Age       9.232682
Rating    0.661628
dtype: float64

C:\Users\Arunima\AppData\Local\Temp/ipykernel_12596/533648258.py:13: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print (df.std())

In [160]:
import pandas as pd
import numpy as np

#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

df = pd.DataFrame(d)
print (df.describe())

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.743333
std     9.232682   0.661628
min    23.000000   2.560000
25%    25.000000   3.230000
50%    29.500000   3.790000
75%    35.500000   4.132500
max    51.000000   4.800000

In [162]:
import pandas as pd
import numpy as np

#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

df = pd.DataFrame(d)
print (df.describe(include=['object']))

       Name
count    12
unique   12
top     Tom
freq      1

In [164]:
import pandas as pd
import numpy as np

#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

#Create a DataFrame
df = pd.DataFrame(d)
print (df. describe(include='all'))

       Name        Age     Rating
count    12  12.000000  12.000000
unique   12        NaN        NaN
top     Tom        NaN        NaN
freq      1        NaN        NaN
mean    NaN  31.833333   3.743333
std     NaN   9.232682   0.661628
min     NaN  23.000000   2.560000
25%     NaN  25.000000   3.230000
50%     NaN  29.500000   3.790000
75%     NaN  35.500000   4.132500
max     NaN  51.000000   4.800000

In [165]:
import pandas as pd
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas"],
    'Fee' :[20000,25000,26000,22000,24000],
    'Duration':['30day','40days','35days','40days','60days'],
    'Discount':[1000,2300,1200,2500,2000]
              }
index_labels=['r1','r2','r3','r4','r5']
df = pd.DataFrame(technologies,index=index_labels)
print(df)

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r4   Python  22000   40days      2500
r5   pandas  24000   60days      2000

In [166]:
#select single row and single columns 
print(df.loc[:, "Courses"])

r1      Spark
r2    PySpark
r3     Hadoop
r4     Python
r5     pandas
Name: Courses, dtype: object

In [167]:
#select multiplerow 
print(df.loc[['r2','r3']])

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200

In [168]:
#select multiple columns
print(df.loc[:, ["Courses","Fee","Discount"]])

    Courses    Fee  Discount
r1    Spark  20000      1000
r2  PySpark  25000      2300
r3   Hadoop  26000      1200
r4   Python  22000      2500
r5   pandas  24000      2000

In [169]:
#Single row and columns
print(df.loc[:,"Courses"])

r1      Spark
r2    PySpark
r3     Hadoop
r4     Python
r5     pandas
Name: Courses, dtype: object

In [170]:
#Multipke columns by rows 
print(df.loc[:,["Courses","Fee","Discount"]])

    Courses    Fee  Discount
r1    Spark  20000      1000
r2  PySpark  25000      2300
r3   Hadoop  26000      1200
r4   Python  22000      2500
r5   pandas  24000      2000

In [171]:
#Select Alternate Rows or Columns
print(df.loc[['r2','r3']])

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200

In [174]:
#select columns between two labels
print(df.loc[:, 'Fee' : 'Discount'])

      Fee Duration  Discount
r1  20000    30day      1000
r2  25000   40days      2300
r3  26000   35days      1200
r4  22000   40days      2500
r5  24000   60days      2000

In [175]:
print(df.loc['r1':'r4':2])

   Courses    Fee Duration  Discount
r1   Spark  20000    30day      1000
r3  Hadoop  26000   35days      1200

In [177]:

#Select Alternate Columns between two Labels
print(df.loc[:,'Fee':'Discount':2])

      Fee  Discount
r1  20000      1000
r2  25000      2300
r3  26000      1200
r4  22000      2500
r5  24000      2000

In [178]:
#Using Conditions with pandas loc

print(df.loc[df['Fee'] >= 24000])

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r5   pandas  24000   60days      2000

In [180]:
print(df.loc[df['Fee']>= 24000])

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r5   pandas  24000   60days      2000

In [188]:
#Complete Examples of pandas DataFrame loc

import pandas as pd
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas"],
    'Fee' :[20000,25000,26000,22000,24000],
    'Duration':['30day','40days','35days','40days','60days'],
    'Discount':[1000,2300,1200,2500,2000]
              }
index_labels=['r1','r2','r3','r4','r5']
df = pd.DataFrame(technologies,index=index_labels)
print(df)

#select single row
print(df.loc['r2'])

#Select Single Column by label
print(df.loc[:, "Courses"])

# Select Rows Between two Index Labels
print(df.loc[:,'Fee':'Discount'])
#Select alternate row by indeces 
print(df.loc['r1':'r4':2])
#Select Alternate Columns between two Labels
print(df.loc[:,'Fee':'Discount':2])
#using condition
print(df.loc[df['Fee'] >= 24000])

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r4   Python  22000   40days      2500
r5   pandas  24000   60days      2000
Courses     PySpark
Fee           25000
Duration     40days
Discount       2300
Name: r2, dtype: object
r1      Spark
r2    PySpark
r3     Hadoop
r4     Python
r5     pandas
Name: Courses, dtype: object
      Fee Duration  Discount
r1  20000    30day      1000
r2  25000   40days      2300
r3  26000   35days      1200
r4  22000   40days      2500
r5  24000   60days      2000
   Courses    Fee Duration  Discount
r1   Spark  20000    30day      1000
r3  Hadoop  26000   35days      1200
      Fee  Discount
r1  20000      1000
r2  25000      2300
r3  26000      1200
r4  22000      2500
r5  24000      2000
    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r5   pandas  24000   60days      2000

In [189]:
import pandas as pd
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas"],
    'Fee' :[20000,25000,26000,22000,24000],
    'Duration':['30day','40days','35days','40days','60days'],
    'Discount':[1000,2300,1200,2500,2000]
              }
index_labels=['r1','r2','r3','r4','r5']
df = pd.DataFrame(technologies,index=index_labels)
print(df)

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r4   Python  22000   40days      2500
r5   pandas  24000   60days      2000

In [190]:
#Select Single Row & Column By Index

print(df.iloc[1])

Courses     PySpark
Fee           25000
Duration     40days
Discount       2300
Name: r2, dtype: object

In [191]:
#Select Single Column by Index
print(df.iloc[:, 0])

r1      Spark
r2    PySpark
r3     Hadoop
r4     Python
r5     pandas
Name: Courses, dtype: object

In [192]:
#Select Multiple Rows & Columns by Index

print(df.iloc[[1,2]])

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200

In [193]:
#Select Multiple Columns by Index
print(df.iloc[:, [0,1,3]])

    Courses    Fee  Discount
r1    Spark  20000      1000
r2  PySpark  25000      2300
r3   Hadoop  26000      1200
r4   Python  22000      2500
r5   pandas  24000      2000

In [194]:
#Select Rows or Columns by Index Range
print(df.iloc[0:4])

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r4   Python  22000   40days      2500

In [195]:
#Select Columns between two Indexes

print(df.iloc[:,1:4])

      Fee Duration  Discount
r1  20000    30day      1000
r2  25000   40days      2300
r3  26000   35days      1200
r4  22000   40days      2500
r5  24000   60days      2000

In [196]:
#Select Alternate Rows or Columns

print(df.iloc[0:4:2])

   Courses    Fee Duration  Discount
r1   Spark  20000    30day      1000
r3  Hadoop  26000   35days      1200

In [197]:
#Select Alternate Columns between two Indexes

print(df.iloc[:,1:4:2])

      Fee  Discount
r1  20000      1000
r2  25000      2300
r3  26000      1200
r4  22000      2500
r5  24000      2000

In [198]:
#By condition
print(df.iloc[list(df['Fee'] >= 24000)])

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r5   pandas  24000   60days      2000

In [199]:
import pandas as pd
technologies= {
    'Courses':["Spark","PySpark","Spark","Java","PySpark","PHP"],
    'Fee' :[22000,25000,23000,24000,26000,27000],
    'Duration':['30days','50days','30days','60days','35days','30days']
          }
df = pd.DataFrame(technologies)
print(df)

   Courses    Fee Duration
0    Spark  22000   30days
1  PySpark  25000   50days
2    Spark  23000   30days
3     Java  24000   60days
4  PySpark  26000   35days
5      PHP  27000   30days

In [200]:
df2 = df.filter(items=['Courses','fee'])
print(df2)

   Courses
0    Spark
1  PySpark
2    Spark
3     Java
4  PySpark
5      PHP

In [201]:
df2 = df.filter(like='ration', axis=1)
print(df2)

  Duration
0   30days
1   50days
2   30days
3   60days
4   35days
5   30days

In [203]:
df2 = df.filter(regex='e$', axis=1)
print(df2)

     Fee
0  22000
1  25000
2  23000
3  24000
4  26000
5  27000

In [204]:
df2=df.filter(items=[3,5], axis=0)
print(df2)

  Courses    Fee Duration
3    Java  24000   60days
5     PHP  27000   30days

In [205]:
df2 = df.filter(like='4', axis=0)
print(df2)

   Courses    Fee Duration
4  PySpark  26000   35days

In [206]:
import pandas as pd
import numpy as np
technologies= {
    'Courses':["Spark","PySpark","Spark","Python","PySpark"],
    'Fee' :[22000,25000,23000,24000,26000],
    'Discount':[1500,1000,1200,800,1300],
    'Duration':['30days','50days','30days','35days','40days']
          }
df = pd.DataFrame(technologies)
print(df)

   Courses    Fee  Discount Duration
0    Spark  22000      1500   30days
1  PySpark  25000      1000   50days
2    Spark  23000      1200   30days
3   Python  24000       800   35days
4  PySpark  26000      1300   40days

In [207]:
df2=df.where(df.Fee > 23000)
print(df2)

   Courses      Fee  Discount Duration
0      NaN      NaN       NaN      NaN
1  PySpark  25000.0    1000.0   50days
2      NaN      NaN       NaN      NaN
3   Python  24000.0     800.0   35days
4  PySpark  26000.0    1300.0   40days

In [208]:
df2=df.where(df.Fee > 23000,'NA')
print(df2)

   Courses    Fee Discount Duration
0       NA     NA       NA       NA
1  PySpark  25000     1000   50days
2       NA     NA       NA       NA
3   Python  24000      800   35days
4  PySpark  26000     1300   40days

In [209]:
cond1 = df.Fee > 23000
cond2 = df.Discount > 900

df2 = df.where(cond1 & cond2, other='NA') 
print(df2)

   Courses    Fee Discount Duration
0       NA     NA       NA       NA
1  PySpark  25000     1000   50days
2       NA     NA       NA       NA
3       NA     NA       NA       NA
4  PySpark  26000     1300   40days

In [210]:
df2=df.query("Courses == 'Spark'")
df2

  Courses    Fee  Discount Duration
0   Spark  22000      1500   30days
2   Spark  23000      1200   30days

In [211]:
value='Spark'
df2=df.query("Courses == @value")
df2

  Courses    Fee  Discount Duration
0   Spark  22000      1500   30days
2   Spark  23000      1200   30days

In [212]:
df.query("Courses == 'Spark'",inplace=True)
print(df)

  Courses    Fee  Discount Duration
0   Spark  22000      1500   30days
2   Spark  23000      1200   30days

In [214]:
df2=df.query("Courses != 'Spark'")

In [215]:
print(df.query("Courses in ('Spark','PySpark')"))

  Courses    Fee  Discount Duration
0   Spark  22000      1500   30days
2   Spark  23000      1200   30days

In [216]:
values=['Spark','PySpark']

In [217]:
print(df.query("Courses in @values"))

  Courses    Fee  Discount Duration
0   Spark  22000      1500   30days
2   Spark  23000      1200   30days

In [220]:
print(df.apply(lambda row: row[df['Courses'].isin(['Spark','PySpark'])]))

  Courses    Fee  Discount Duration
0   Spark  22000      1500   30days
2   Spark  23000      1200   30days

In [221]:
import pandas as pd
import numpy as np
data = [(3,5,7), (2,4,6),(5,8,9)]
df = pd.DataFrame(data, columns = ['A','B','C'])
print(df)

   A  B  C
0  3  5  7
1  2  4  6
2  5  8  9

In [222]:
def add_4(x):
   return x+4
df["B"] = df["B"].apply(add_4)
print(df)

   A   B  C
0  3   9  7
1  2   8  6
2  5  12  9

In [223]:
def add_4(x):
    return x+4
df["B"] = df["B"].apply(add_4)
print(df)

   A   B  C
0  3  13  7
1  2  12  6
2  5  16  9

In [225]:
def add_4(x):
    return x+4
df["A"] = df["A"].apply(add_4)
print(df)

   A   B  C
0  7  17  7
1  6  16  6
2  9  20  9

In [227]:
import pandas as pd
import numpy as np
data = [(3,5,7), (2,4,6),(5,8,9)]
df = pd.DataFrame(data, columns = ['A','B','C'])
print(df)

   A  B  C
0  3  5  7
1  2  4  6
2  5  8  9
   A  B  C
0  3  5  7
1  2  4  6
2  5  8  9

In [229]:
def add_3(x):
    return x+3
df2 = df.apply(add_3)
print(df2)

   A   B   C
0  6   8  10
1  5   7   9
2  8  11  12

In [230]:
df = pd.DataFrame(data, columns = ['A','B','C'])

df[['A', 'B']] = df[['A', 'B']].apply(add_3)

print(df)

   A   B  C
0  6   8  7
1  5   7  6
2  8  11  9

In [233]:
df2 = df.apply(lambda x : x + 10)
print(df2)

    A   B   C
0  16  18  17
1  15  17  16
2  18  21  19

In [235]:
df["A"] = df["A"].apply(lambda x : x - 2)
print(df)

    A   B  C
0  14   8  7
1  13   7  6
2  16  11  9

In [236]:
import pandas as pd
import numpy as np
data = [(3,5,7), (2,4,6),(5,8,9)]
df = pd.DataFrame(data, columns = ['A','B','C'])
print(df)

   A  B  C
0  3  5  7
1  2  4  6
2  5  8  9

In [ ]:
def add_2(x):
    return x+2